// Найти сумму чисел от 1 до А
Console.WriteLine("Введите число - ");
int a = int.Parse(Console.ReadLine());

Console.WriteLine((a*(a+1))/2);